<template>
  <f7-panel left
            cover>
    <f7-block-title>Параметры</f7-block-title>
    <f7-list accordion-list>
      <f7-list-item accordion-item
                    v-for="(param, index) in params"
                    :key="index"
                    :title="param.title"
                    @click="setParameter(param.value)">
        <f7-accordion-content>
          <f7-block>
            <p>
              {{param.description}}
            </p>
          </f7-block>
        </f7-accordion-content>
      </f7-list-item>
    </f7-list>
  </f7-panel>
</template>
<script>
export default {
  data() {
    return {
      params: [
        {
          title: "Диоксид углерода",
          value: "cO2",
          description: `Углекислый газ, газ без запаха и цвета, тяжелее воздуха, при сильном охлаждении кристаллизуется
              в виде белой снегообразной массы — «сухого льда». При атмосферном давлении
              он не плавится, а испаряется, температура сублимации −78 °С. Углекислый
              газ образуется при гниении и горении органических веществ. Содержится
              в воздухе и минеральных источниках, выделяется при дыхании животных
              и растений. Растворим в воде (0,738 объёмов углекислого газа в одном
              объёме воды при 15 °С).`
        },
        {
          title: "Сжи́женные углеводоро́дные га́зы",
          value: "lpg",
          description: `   Смесь сжиженных под давлением лёгких углеводородов с температурой кипения от −50
              до 0 °C. Предназначены для применения в качестве топлива, а также используются
              в качестве сырья для органического синтеза. Состав может существенно
              различаться, основные компоненты: пропан, изобутан и н-бутан.`
        },
        {
          title: "Oксид углерода",
          value: "co",
          description: `Бесцветный чрезвычайно токсичный газ без вкуса и запаха, легче воздуха (при нормальных
              условиях).`
        },
        {
          title: "Пыль",
          value: "dust",
          description: ` Мелкие твёрдые частицы органического или минерального происхождения. К пыли относят
              частицы меньшего диаметра от долей микрона и до максимального — 0,1
              мм. Более крупные частицы переводят материал в разряд песка, который
              имеет размеры от 0,1 до 5 мм.`
        }
      ]
    };
  },
  methods: {
    setParameter(parameter) {
      this.$emit("parameterSelected", parameter);
    }
  },
  props: ["currentParameter"]
};
</script>
